<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Ayuda cursos</title>
</head>
<body>
    <h1>AYUDA CURSO</h1>
    <img src="../images/curso/1.png">
    <p>En la imagen anterior se ve la escena para rellenar con los datos de un nuevo curso.
        En la zona superior aparece una etiqueta con el texto "Datos acad&eacute;micos del curso" y un conjunto de cuadros de textos con sus etiquetas asociadas. 
        Entre ellas la de categor&iacute;as cuyos valores posibles podr&iacute;an ser las mostradas en la imagen.</p>
        <img src="../images/curso/2.png">
    <ul>
        <li><b>Nombre:</b> debemos introducir el nombre del curso.</li>
        <li><b>Duraci&oacute;n:</b> debemos introducir la duraci&oacute;n del curso, dicho dato debe estar expresado en horas.</li>
        <li><b>Proveedor:</b> debemos introducir el proveedor del curso.</li>
        <li><b>Categor&iacute;a:</b> debemos seleccionar una categor&iacute;a de entre las posibles.</li>
        <li><b>Certificaci&oacute;n:</b> debemos introducir el tipo de certificaci&oacute;n que obtendremos con el curso.</li>
    </ul>

    <img src="../images/curso/3.png">
    <ul>
        <li><b>Fecha de inicio:</b> seleccionaremos la fecha de inicio del curso. Esta por defecto ser&aacute; la del d&iacute;a actual. No podr&aacute; seleccionar una fecha de inicio anterior a la del d&iacute;a actual.</li>
        <li><b>Fecha de fin:</b> seleccionaremos la fecha de fin del curso. No podr&aacute; seleccionar una fecha de fin anterior a la fecha de inicio.</li>
        <li><b>N&uacute;mero de asistentes:</b> indicaremos el n&uacute;mero de asistentes del curso. Debemos modificar este dato mediante el Spinner.</li>
        <li><b>Instructor/a:</b> debemos seleccionar un instructor de entre los posibles.</li>
        <li><b>Tipo:</b> nos permite seleccionar el tipo de curso, pudiendo elegir ente <b>Oficial</b>, <b>Online</b>, y <b>Video bajo demanda</b></li>
        <li><b>Beca:</b> indica si dicho curso est&aacute; acogido a alg&uacute;n tipo de ayuda.</li>
        <li><b>Importe:</b> debemos introducir el coste del curso. A la cantidad num&eacute;rica introducida se le a&ntilde;ade el formato moneda (&euro;) autom&aacute;ticamente.</li>
    </ul>

    <p>En la parte inferior de la App encontraremos los siguientes botones: </p>
    <img src="../images/curso/4.png">
    <ul>
        <li><b>Aceptar:</b> informar&aacute; al usuario si est&aacute; seguro que desea realizar la operaci&oacute;n. En caso de aceptar y tener todos los datos introducidos correctamente,
            introducir&aacute; los datos en la base de datos y nos mostrar&aacute; una alerta de confirmaci&oacute;n, seguidamente, se limpiar&aacute;n los campos para poder introducir un nuevo curso.
            En caso de cancelar volver&aacute; a la vista de modificaci&oacute;n de datos. 
            Si al pulsar el bot&oacute;n aceptar tenemos campos vac&iacute;os o con errores nos mostrar&aacute; una alerta con los errores que debemos corregir, adem&aacute;s se marcar&aacute;n dichos campos con errores de color rojo.</li>
        <li><b>Cancelar:</b> devuelve a la pantalla principal sin realizar ninguna acci&oacute;n.</li>
        <li><b>Limpiar:</b> vaciar&aacute; los datos que hayan introducidos en los campos hasta el momento.</li>
    </ul>
</body>
</html>